Revit 2027 API
FabricArea.MinorLapSpliceLength Property
 The fabric lap splice length in the fabric distribution in the minor direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MinorLapSpliceLength { get; set; }
Public Property MinorLapSpliceLength As Double
	Get
	Set
public:
property double MinorLapSpliceLength {
	double get ();
	void set (double value);
}
member MinorLapSpliceLength : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: minorLapSpliceLength is greater than the half of the overall width.
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace